---
type: AssetPropertyDouble
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 2
tags: [revit-api, class]
---

# AssetPropertyDouble

`Autodesk.Revit.DB.Visual.AssetPropertyDouble` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | IsValidValue | 2018.1 | `public bool IsValidValue ( double value )` |
| Property | Value | — | `public double Value { get ; set ; }` |